server/sql/testdata/soapxml/getSendStatus.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns4="http://x-tee.riik.ee/xsd/xtee.xsd" xmlns:ns5="http://producers.dhl.xtee.riik.ee/producer/dhl" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Header>
		<ns4:asutus xsi:type="xsd:string">adit</ns4:asutus>
		<ns4:andmekogu xsi:type="xsd:string">dhl</ns4:andmekogu>
		<ns4:isikukood xsi:type="xsd:string">EE38806190294</ns4:isikukood>
		<ns4:id xsi:type="xsd:string">6cae248568b3db7e97ff784673a4d38c5906bee0</ns4:id>
		<ns4:nimi xsi:type="xsd:string">dhl.getSendStatus.v2</ns4:nimi>
		<ns4:toimik xsi:type="xsd:string"/>
		<ns4:amet xsi:type="xsd:string"/>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<ns5:getSendStatus>
			<keha>
				<dokumendid href="cid:getSendStatus_manus"/>
				<staatuse_ajalugu>true</staatuse_ajalugu>
			</keha>
		</ns5:getSendStatus>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>